Revit 2026 API

# TriOrQuadFacet Class

---

This class represents a triangle or quadrilateral in a faceted structure.

SystemObject Autodesk.Revit.DBTriOrQuadFacet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TriOrQuadFacet : IDisposable
```
```vb
Public Class TriOrQuadFacet
	Implements IDisposable
```
```cpp
public ref class TriOrQuadFacet : IDisposable
```
```fsharp
type TriOrQuadFacet =
    class
        interface IDisposable
    end
```

The TriOrQuadFacet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Normal | A unit normal vector for this facet. |
|  | NumberOfVertices | The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TriOrQuadFacet |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetVertexIndex | Returns the index of the specified vertex of this facet (as an index into the external array of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets). |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class defines a triangle or quadrilateral with reference to an external triangulation structure. The vertices of this TriOrQuadFacet are indices into the triangulation structure's array of vertices.

#### Reference

Autodesk.Revit.DB Namespace